InformationRegisters/ЗнаниеЯзыковФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ЗнаниеЯзыковФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтепеньЗнанияЯзыка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтепениЗнанияЯзыка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯзыкиНародовМира</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗнаниеЯзыковФизическихЛиц/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#Область СлужебныеПроцедурыИФункции

Функция ПредставлениеВладениеЯзыкамиФизическогоЛица(ФизическоеЛицоСсылка) Экспорт
	
	ЗнаниеЯзыков = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗнаниеЯзыковФизическихЛиц.Язык,
		|	ЗнаниеЯзыковФизическихЛиц.СтепеньЗнанияЯзыка
		|ИЗ
		|	РегистрСведений.ЗнаниеЯзыковФизическихЛиц КАК ЗнаниеЯзыковФизическихЛиц
		|ГДЕ
		|	ЗнаниеЯзыковФизическихЛиц.ФизическоеЛицо = &ФизическоеЛицоСсылка";
		
	Запрос.УстановитьПараметр("ФизическоеЛицоСсылка", ФизическоеЛицоСсылка);
	
	Возврат ПредставлениеВладениеЯзыкамиПоКоллекцииЗаписей(Запрос.Выполнить().Выгрузить());
	
КонецФункции

Функция ПредставлениеВладениеЯзыкамиПоКоллекцииЗаписей(НаборЗаписей) Экспорт
	
	ПредставлениеВладениеЯзыками = "";
	
	Для Каждого СтрокаЗнаниеЯзыков Из НаборЗаписей Цикл
		ПредставлениеВладениеЯзыками 	= ПредставлениеВладениеЯзыками + ?(ПустаяСтрока(ПредставлениеВладениеЯзыками), "", ", ") 
									+ ?(ЗначениеЗаполнено(СтрокаЗнаниеЯзыков.Язык), Строка(СтрокаЗнаниеЯзыков.Язык), "")
									+ ?(ЗначениеЗаполнено(СтрокаЗнаниеЯзыков.СтепеньЗнанияЯзыка), " (" + Строка(СтрокаЗнаниеЯзыков.СтепеньЗнанияЯзыка) + ")", "");
	КонецЦикла;
	
	Если ПустаяСтрока(ПредставлениеВладениеЯзыками) Тогда
		ПредставлениеВладениеЯзыками = НСтр("ru='Не владеет языками';uk='Не володіє мовами'");
	КонецЕсли; 
	
	Возврат ПредставлениеВладениеЯзыками;
	
КонецФункции

#КонецОбласти

#КонецЕсли
